# Завдання:
1. Створіть датафрейм розміром 15*5, що містить наступні дані:
    а) ім'я та прізвище студента;
    б) середній бал
    в) оцінка за поточний екзамен
    г) кількість спроб здачі поточного екзамену

2. Додайте до датафрейму стовпчик, що містить дані про допуск студента на наступний курс.

3. Виведіть мінімальний, максимальний, середній та медіанний показники середнього балу студентів.
4. Виведіть кількість студентів, що склали поточний екзамен з першого разу.
5. Збережіть будь-які дані з датафрейму у вигляді серії.

In [130]:
import pandas as pd
import names
import numpy as np

np.random.seed(2023)

## Рішення:
1. Створіть датафрейм розміром 15*5:

In [131]:
students = {
    'name': [names.get_full_name() for _ in range(15)],
    'GPA': np.random.normal(70, 8, size=15),
    'grade': np.random.normal(80, 8, size=15),
    'exam_attempts': np.random.randint(1, 4, size=15)
}

students_df = pd.DataFrame.from_dict(students)
students_df

                name        GPA      grade  exam_attempts
0         Tommy Diaz  75.693388  75.825806              1
1      Denise Sawyer  67.404120  76.617939              2
2       David Thomas  61.985035  79.206047              3
3     Michelle Grant  71.890006  68.957936              1
4     James Billings  69.182721  82.415223              1
5       John Mcgrath  60.869659  71.731205              3
6   Shirley Martinez  91.235258  67.982580              1
7      Johnny Bickel  81.524842  68.963253              3
8       Howard Horst  70.791218  78.364361              3
9     Leslie Bellamy  45.027743  85.137000              2
10     Robin Spencer  61.387827  78.550596              2
11   James Benavidez  67.394544  86.173993              1
12       Joan Barker  61.716017  85.932188              1
13      Mary Mallard  66.589437  90.598102              2
14        Marya Doty  61.765109  83.514294              2

2. Додайте до датафрейму стовпчик, що містить дані про допуск студента на наступний курс:

In [132]:
students_df['admission'] = np.random.choice(a=[True, False], size=(15, 1), p=[0.7, 0.3])
students_df

                name        GPA      grade  exam_attempts  admission
0         Tommy Diaz  75.693388  75.825806              1       True
1      Denise Sawyer  67.404120  76.617939              2       True
2       David Thomas  61.985035  79.206047              3       True
3     Michelle Grant  71.890006  68.957936              1       True
4     James Billings  69.182721  82.415223              1       True
5       John Mcgrath  60.869659  71.731205              3       True
6   Shirley Martinez  91.235258  67.982580              1      False
7      Johnny Bickel  81.524842  68.963253              3       True
8       Howard Horst  70.791218  78.364361              3      False
9     Leslie Bellamy  45.027743  85.137000              2      False
10     Robin Spencer  61.387827  78.550596              2       True
11   James Benavidez  67.394544  86.173993              1       True
12       Joan Barker  61.716017  85.932188              1      False
13      Mary Mallard  66.589437  90.598102              2       True
14        Marya Doty  61.765109  83.514294              2      False

3. Виведіть мінімальний, максимальний, середній та медіанний показники середнього балу студентів:

In [133]:
students_df['GPA'].agg(['min', 'max', 'mean', 'median'])

min       45.027743
max       91.235258
mean      67.630462
median    67.394544
Name: GPA, dtype: float64

4. Виведіть кількість студентів, що склали поточний екзамен з першого разу:

In [134]:
len(students_df[students_df['exam_attempts'] == 1])

6

5. Збережіть будь-які дані з датафрейму у вигляді серії.

In [135]:
name_series = students_df['name'].squeeze()
print(name_series)
print(type(name_series))

0           Tommy Diaz
1        Denise Sawyer
2         David Thomas
3       Michelle Grant
4       James Billings
5         John Mcgrath
6     Shirley Martinez
7        Johnny Bickel
8         Howard Horst
9       Leslie Bellamy
10       Robin Spencer
11     James Benavidez
12         Joan Barker
13        Mary Mallard
14          Marya Doty
Name: name, dtype: object
<class 'pandas.core.series.Series'>